# 1.Напишите функцию, которая вычисляет квадрат числа.
# def ab(a,b):
#     return a*b
# 2.Напишите функцию, которая возвращает массив из 10 рандомных целых чисел.
# from random import randint
# def nums(n):
#     return [randint(1,n) for i in range(n)]
# print(nums(11))

# 3.Напишите функцию, которая принимает строку и возвращает ее в обратном порядке.
# def rev(a):
#     return a[::-1]
# print(rev("qasda"))

# 4.Напишите функцию для подсчета суммы элементов массива.
# def suml(a):
#     return sum(a)
# print(suml(a=[1,1,6,4,3]))

# 5.Напишите функцию для проверки строки на то, является ли она палиндромом.
# def palindrom(a):
#     return a == a[::-1]
# print(palindrom("lola"))

# 6.Напишите функцию для перевода числа из десятичной системы счисления в двоичную систему.
# def count_bits(n):
#     return bin(n)
# print(count_bits(10))
# 7.Напишите функцию для сравнения двух целых чисел и возврата 1, 0 или -1 в зависимости от того,
# является ли первое число меньше, равным или больше второго.
# def comp(a, b):
#     return 1 if a > b else 0 if a == b else -1
# print(comp(4,9))

# 8.Напишите функцию для подсчета количества слов в строке.
# def cou(a):
#     count = 0
#     b = a.split()
#     c = len(b)
#     return c
# print(cou("asmdkas asdnaskd aasdsakdas"))

# 9.Напишите функцию для разбиения строки на отдельные слова.
# def partiton(a):
#     return a.split()
# print(partiton("asmdsak asdmaskdmas samdaspkfmas"))